In [1]:
import pandas as pd
import numpy as np

In [6]:
# 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and 
#return a url connection string formatted like in the example at the start of this lesson.

def get_sql_url(user, password, host, database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [7]:
# 4. Use your function to obtain a connection to the employees database.

from env import user, password, host

pd.read_sql("SELECT * FROM employees", get_sql_url(user, password, host, 'employees'))

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [ ]:
url = f'mysql+pymysql://{user}:{password}@{hosts}/employees'

In [ ]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

In [ ]:

pd.read_sql('SELECT *  employees LIMIT 5 OFFSET 50', url)

In [ ]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

In [ ]:
sql = '''
SELECT *
FROM employees
'''

employees = pd.read_sql(sql, url)
employees

In [ ]:
sql = '''
SELECT *
FROM titles
'''

titles = pd.read_sql(sql, url)
titles

# Exercises II

In [ ]:
# 1. Copy the users and roles DataFrames from the examples above.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

In [ ]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

In [ ]:
# 2. What is the result of using a right join on the DataFrames?
join_right = users.merge(roles,left_on='role_id', right_on= 'id', how='right',indicator=True)
join_right

In [ ]:
# 3. What is the result of using an outer join on the DataFrames?
join_outer = users.merge(roles,left_on='role_id', right_on= 'id', how='outer',indicator=True)
join_outer

In [ ]:
# 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?
drop_fk = users.merge(roles,left_on='role_id', right_on='id', how='outer').drop(columns='role_id')
drop_fk

In [ ]:
# 5. Load the mpg dataset from PyDataset.
from pydataset import data
mpg = data('mpg')

In [ ]:
# 6. Output and read the documentation for the mpg dataset.
mpg.info()

In [ ]:
# 7. How many rows and columns are in the dataset?
#234 rows & 11 columns

In [ ]:
# 8. Check out your column names and perform any cleanup you may want on them.
mpg.head()

In [ ]:
# 9. Display the summary statistics for the dataset.
mpg.describe()

In [ ]:
# 10. How many different manufacturers are there?
mpg.manufacturer.unique().size

In [ ]:
# 11. How many different models are there?
mpg.model.unique().size

In [ ]:
# 12. Create a column named mileage_difference like you did in the DataFrames exercises; 
#this column should contain the difference between highway and city mileage for each car.

In [ ]:
# 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
# 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
# 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
# 16. Do automatic or manual cars have better miles per gallon?

# Exercises III

In [11]:
# 1. Use your get_db_url function to help you explore the data from the chipotle database.

pd.read_sql("SELECT * FROM orders", get_sql_url(user, password, host, 'chipotle'))

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [ ]:
# 2. What is the total price for each order?

In [ ]:
# 3. What are the most popular 3 items?

In [ ]:
# 4. Which item has produced the most revenue?

In [ ]:
# 5. Join the employees and titles DataFrames together.

In [ ]:
# 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [ ]:
# 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)